
# 8.2 기타평활법의 분석사례

# 1) 이동 Median 평활법 분석사례: runmed


# (1) 자료입력 및 이동 Median 평활법 분석

dd1.ts <- ts(data=dd1, start=c(2006, 1), frequency=4)
dd1.ts

me1 <- runmed(dd1, k=3)
me1.ts <- ts(me1, s=c(2006, 1), f=4)
me1.ts
     Qtr1 Qtr2 Qtr3 Qtr4
2006 1342 1342 1343 1343
2007 1362 1425 1362 1272
2008 1272 1359 1359 1253
2009 1253 1322 1406 1322
2010 1289 1289 1289 1289

# (2) 분석결과

plot(dd1.ts, type="b", main="Moving Median Smoothing: dd1")
lines(me1.ts, col="red", lty=2, lwd=2)
legend("bottomright", c("Moving Average", "Moving Median"), c=c(4, 2), lty=c(1, 2), lwd=c(2, 2))
res <- me1.ts - dd1.ts # 잔차: 조사값 - 추정값
tsdisplay(res, main="Residuals by Moving Median: dd1") # 일부 자료가 95% 신뢰구간 밖에 존재
Box.test(res)

	Box-Pierce test

data:  res
X-squared = 6.9019, df = 1, p-value = 0.008611 # H0 기각: 잔차의 자기상관 존재

# (3) 자료의 처음과 끝부분의 처리



# (4) 예측결과



# 2) 이동 Median - Tukey 평활법 분석사례: smooth

# 3) Chart 분석 주식시장 등에서 사용되는 단순 이동평균 적용사례

# (1) 분석결과 

w1 <- rep(1, 6) / 6
w2 <- rep(1,12) /12
ff1 <- filter(nhtemp, filter=w1, method="convolution")
ff2 <- filter(nhtemp, filter=w2, method="convolution")
plot(nhtemp, ylab="Series", main="Chart Analysis by Moving Average") # 여기선 nhtemp로 그리고
lines(ff1, col="red", lty=2, lwd=2)
lines(ff2, col="blue", lty=2, lwd=2)
legend("bottomright", c("Short Range", "Long Range"), c=c("red", "blue"), lty=c(2,6), lwd=c(2,2), cex=.7)
legend(1913, 53, c("Golden Cross"), cex=.6)
legend(1955, 53.5, c("Dead Cross"), cex=.6)

pp <- matrix(c(nhtemp))
fm1 <- runmed(pp, k=5) # 모델 인풋은 matrix 화된 nhtemp 사용
fm2 <- runmed(pp, k=11) # 인풋을 시계열로 써도 아웃풋은 시계열 아닌 일반 array로 나옴
plot(pp, type="l", ylab="Series", main="Chart Analysis by Moving Median") # 여기선 pp로 그렸다는 점
lines(fm1, col="red", lty=2, lwd=2)
lines(fm2, col="blue", lty=2, lwd=2)
legend("bottomright", c("Short Range", "Long Range"), c=c("red", "blue"), lty=c(2,6), lwd=c(2,2), cex=.7)

# 참고: filter (이동평균) 모델 아웃풋
ff1
Time Series:
Start = 1912 
End = 1971 
Frequency = 1 
 [1]       NA       NA 50.00000 49.98333 49.75000 49.73333 49.86667 50.10000 50.38333 50.30000
[11] 50.25000 50.10000 49.90000 49.91667 50.08333 50.45000 50.81667 51.38333 51.45000 51.26667
[21] 51.20000 51.01667 50.81667 50.81667 50.78333 50.61667 50.86667 50.96667 50.80000 50.78333
[31] 50.88333 51.43333 51.36667 51.36667 51.93333 51.88333 52.08333 52.25000 52.80000 52.96667
[41] 52.63333 52.55000 52.53333 52.05000 51.71667 51.65000 51.63333 51.56667 51.28333 51.53333
[51] 51.33333 51.35000 51.16667 51.40000 51.55000 51.58333 51.85000       NA       NA       NA

ff2
Time Series:
Start = 1912 
End = 1971 
Frequency = 1 
 [1]       NA       NA       NA       NA       NA 50.19167 50.14167 50.00000 49.91667 49.88333
[11] 50.00833 50.23333 50.37500 50.53333 50.74167 50.67500 50.59167 50.64167 50.73333 50.81667
[21] 51.10000 51.11667 50.94167 51.03333 50.99167 50.80833 50.80000 50.83333 51.02500 51.11667
[31] 51.16667 51.36667 51.33333 51.48333 51.84167 52.08333 52.16667 52.28333 52.21667 52.30833
[41] 52.15000 52.25833 52.30833 52.13333 52.05833 51.90833 51.79167 51.52500 51.50000 51.40000
[51] 51.48333 51.41667 51.55833 51.59167       NA       NA       NA       NA       NA       NA

# 참고: runmed (이동 Median) 모델 아웃풋 
fm1
 [1] 49.9 49.9 49.9 49.4 49.4 49.8 49.4 49.8 50.8 50.8 49.6 50.6 49.6 49.6 50.6 50.6 50.7 50.9 51.5 51.5
[21] 51.5 51.1 50.4 50.4 50.4 50.9 50.9 51.6 51.0 50.9 51.0 51.5 51.5 51.5 51.5 51.5 51.4 51.4 52.7 53.1
[41] 52.7 52.7 52.0 52.0 52.0 52.0 51.6 51.9 51.6 51.6 51.6 51.4 51.4 51.4 51.7 51.7 51.8 51.9 51.9 51.9
attr(,"k")
[1] 5

fm2
 [1] 49.9 49.9 49.9 49.9 49.8 49.9 49.8 49.6 49.8 49.6 49.8 50.6 50.6 50.6 50.7 50.7 50.7 50.7 50.7 50.7
[21] 50.9 51.1 51.1 51.1 51.1 51.0 50.9 50.9 51.0 51.5 51.5 51.3 51.3 51.4 51.5 51.5 51.7 52.0 52.0 52.0
[41] 52.0 52.0 52.6 52.0 52.0 52.0 51.9 51.7 51.6 51.6 51.6 51.6 51.7 51.7 51.7 51.7 51.8 51.9 51.9 51.9
attr(,"k")
[1] 11


